/*式と演算子 */
//3 + 5 3と5はオペランド、+は演算子
//age = 20 ageと20はオペランド、=は演算子
//'あ'はchar型文字、"あ"はString型文字
void main() {
    //[¥"]は二重引用符記号
    //[¥']は引用符記号
    //[¥¥]は円記号
    //[¥n]は改行
    IO.println("私の好きな記号は二重引用符記号（\"）です。");
    IO.println("お会計は¥¥1000です。");
    IO.println("改行します。¥n改行しました。");

    /*複合代入演算子
        a += 3 は a = a + 3 と同じ意味
        b -= 5 は b = b - 5 と同じ意味
        c *= 2 は c = c * 2 と同じ意味
        d /= 4 は d = d / 4 と同じ意味
        e %= 6 は e = e % 6 と同じ意味
    */
    /*インクリメント演算子とデクリメント演算子
        ++a は a = a + 1 と同じ意味
        --b は b = b - 1 と同じ意味
    */

    /*
    以下の場合、出力結果が異なるので注意すること(前置インクリメントと後置インクリメント)*/
    int a = 10;
    int b = 10;
    IO.println(++a + 50);
    IO.println(b++ + 50);
    /*
    後置インクリメントの場合、「現在の値のまま式を計算したあと、最後に変数に1を足す（後置）」という意味になる。
    コンピュータの中ではコンマ数秒の間に次のような順番で処理が行われる。
    1.コンピュータは b++ を見たとき、「あ、これは後置（あとから増やすやつ）だな」と判断する。
    そのため、この計算の瞬間はまだ古い値である 10 が採用される。
    2.10 + 50 が計算され、結果として 60 が生まれる。
    3.生まれたばかりの 60 が IO.println に渡され、画面に 60 が表示される。
    （※出力はここで完了）
    4.画面への出力が終わった「直後」、この行の処理が完全に終わるタイミングで、裏で b に 1 が足される。これで b は 11 になる。
    
    [結論]として、「60を出力する」という仕事が完了したあとで、おまけのように b が 11 に書き換わっているから。
    そのためもう一度 IO.println(b); と書いて確認してみると、画面にはちゃんと 11 が表示される。
    */
    IO.println(b);

    /*命令実行文の種類 */
    //改行なしの出力文
    IO.print("私は");
    IO.print("田中です。\n");

    //2つの値を比較して大きい方を返す
    int c = 10;
    int d = 20;
    int e = Math.max(c, d);
    IO.println("大きい方は" + e + "です。");
}



